emacs/.config/emacs/config.org
#+Title: Emacs Config
#+Author: Mathis Albertzard
#+Description: My Config based on a starter config probably don't use this I have no clue
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Table Of Contents :toc_3:
- [[#grunt-work-to-make-emacs-behave][Grunt work to make emacs behave]]
  - [[#bootstrapping-and-installing-packages][Bootstrapping and installing packages]]
  - [[#keep-folders-clean][Keep folders clean]]
  - [[#sensible-defaults][Sensible Defaults]]
  - [[#performance-tweaks][Performance Tweaks]]
  - [[#start-emacs-server-on-startup][Start emacs server on startup]]
  - [[#save-changes-automaticly][Save changes automaticly]]
  - [[#making-repetions-easier][Making repetions easier]]
- [[#ui-stuff][UI Stuff]]
  - [[#line-numbers][Line Numbers]]
  - [[#scroll-margins][Scroll Margins]]
  - [[#modeline][Modeline]]
  - [[#theme][Theme]]
  - [[#font][Font]]
  - [[#modeline-1][Modeline]]
  - [[#zoom][Zoom]]
  - [[#which-key][Which Key]]
- [[#completions][Completions]]
  - [[#completions-at-point][Completions at point]]
  - [[#vertical-completions][Vertical Completions]]
  - [[#actions-on-completions][Actions on completions]]
- [[#development][Development]]
  - [[#infos][Infos]]
  - [[#error][Error]]
  - [[#syntax-hightlighting][Syntax Hightlighting]]
    - [[#treesitter-config][Treesitter Config]]
    - [[#php-mode][PHP Mode]]
    - [[#lua-mode][Lua Mode]]
  - [[#lsp][LSP]]
    - [[#dape][Dape]]
    - [[#eglot][Eglot]]
    - [[#eglot-booster][Eglot Booster]]
  - [[#terminal-emulation][Terminal Emulation]]
  - [[#docker][Docker]]
- [[#project-managment][Project Managment]]
  - [[#projectile][Projectile]]
  - [[#perspective][Perspective]]
  - [[#editor-conf][Editor Conf]]
  - [[#git-stuff][Git Stuff]]
    - [[#magit][Magit]]
    - [[#gutter][Gutter]]
  - [[#file-managment][File Managment]]
    - [[#wgrep][Wgrep]]
    - [[#dired-tweaks][Dired Tweaks]]
    - [[#harpoon][Harpoon]]
- [[#helper-packages][Helper packages]]
  - [[#surround][Surround]]
  - [[#move-files][Move Files]]
  - [[#better-undo-and-redo][Better undo and redo]]
  - [[#making-emacs-more-explorable][Making emacs more explorable]]
  - [[#manage-system-packages-from-inside-emacs][Manage System packages from inside Emacs]]
  - [[#devdocs][DevDocs]]
  - [[#usefull-commands][Usefull commands]]
  - [[#collection-of-usefull-commands][Collection of usefull commands]]
- [[#file-spezific-modes][File spezific Modes]]
  - [[#rust][Rust]]
  - [[#python][Python]]
  - [[#markdown][Markdown]]
    - [[#obsidian][Obsidian]]
    - [[#markdown-mode][Markdown Mode]]
  - [[#org][Org]]
    - [[#org-mode][Org Mode]]
    - [[#table-of-contents][Table of Contents]]
    - [[#org-modern][Org Modern]]
- [[#keymaps][Keymaps]]
  - [[#meow][Meow]]
    - [[#meow-basic-layout][Meow Basic Layout]]
    - [[#meow-things-for-semantic-editing][Meow Things for semantic editing]]
  - [[#window--buffer-nav][Window / Buffer Nav]]
    - [[#mark-ring-nav][Mark Ring Nav]]
    - [[#buffer][Buffer]]
    - [[#switching-windows][Switching Windows]]
  - [[#developent][Developent]]
    - [[#git][Git]]
    - [[#terminal][Terminal]]
    - [[#error-1][Error]]
  - [[#replacing-stuff][Replacing stuff]]
  - [[#finding-stuff][Finding Stuff]]
  - [[#other-stuff][Other Stuff]]
    - [[#project-mangent][Project Mangent]]

* Grunt work to make emacs behave
** Bootstrapping and installing packages

straight.el: Bootstraps the straight.el package manager, ensuring it's installed and up-to-date.
use-package: Configures use-package for package management, ensuring packages are installed via straight.el.

#+begin_src emacs-lisp
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name
            "straight/repos/straight.el/bootstrap.el"
            (or (bound-and-true-p straight-base-dir)
                user-emacs-directory)))
          (bootstrap-version 7))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))

    (straight-use-package 'use-package)
    (straight-use-package 'org)

    (setq straight-use-package-by-default t)
#+end_src

** Keep folders clean
#+begin_src emacs-lisp
    (use-package no-littering
      :config
      (no-littering-theme-backups))

    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
#+end_src

** Sensible Defaults
#+BEGIN_SRC emacs-lisp
    (use-package emacs
      :custom
      (menu-bar-mode nil)         
      (scroll-bar-mode nil)       
      (tool-bar-mode nil)         
      (inhibit-startup-screen t)  
      (delete-selection-mode t)   
      (electric-indent-mode nil)  
      (electric-pair-mode t)      
      (display-battery-mode t)
      (ring-bell-function 'ignore)
      (blink-cursor-mode nil)     
      (global-auto-revert-mode t) 
      (dired-kill-when-opening-new-dired-buffer t)
      (truncate-lines t)
      (gnus-agent nil)
      (defalias 'yes-or-no-p 'y-or-n-p)
      (mouse-wheel-progressive-speed nil) 
      (tab-width 4)
      (make-backup-files nil)
      (auto-save-default nil)
      :config
      :bind (
    		 ([escape] . keyboard-escape-quit) ;; Makes Escape quit prompts (Minibuffer Escape)
    		 )
      :hook
      (prog-mode . (lambda () (hs-minor-mode t))))
#+END_SRC
** Performance Tweaks
#+begin_src emacs-lisp
    ;; Make gc pauses faster by decreasing the threshold.
    (setq gc-cons-threshold (* 2 1000 1000))
    ;; Increase the amount of data which Emacs reads from the process
    (setq read-process-output-max (* 1024 1024)) ;; 1mb
#+END_SRC

** Start emacs server on startup
Ensure the Emacs server is started if not already running
#+begin_src emacs-lisp
    (require 'server)
    (unless (server-running-p)
      (server-start))
#+END_SRC
** Save changes automaticly

#+BEGIN_SRC emacs-lisp
    (custom-set-variables
     '(auto-save-visited-mode t))

    (setq auto-save-visited-interval 2)
#+END_SRC
** Making repetions easier
#+BEGIN_SRC emacs-lisp 
    ;;;(repeat-mode)
#+END_SRC
* UI Stuff
** Line Numbers
#+BEGIN_SRC emacs-lisp 
    (use-package emacs
      :custom
      (display-line-numbers-type 'relative) 
      (global-display-line-numbers-mode t))

    (defun disable-line-numbers ()
      "Disable display-line-numbers-mode for certain modes."
      (display-line-numbers-mode 0))

    (add-hook 'dired-mode-hook 'disable-line-numbers)
    (add-hook 'eat-mode-hook 'disable-line-numbers)
    (add-hook 'org-mode-hook 'disable-line-numbers)
    (add-hook 'compilation-mode-hook 'disable-line-numbers)
#+end_src
** Scroll Margins
#+BEGIN_SRC emacs-lisp 
    (use-package emacs
      :custom
      (scroll-conservatively 10)
      (scroll-margin 10))
#+END_SRC
** Modeline
#+BEGIN_SRC emacs-lisp
    (use-package time
      :config
      (setq display-time-24hr-format t)
      (setq display-time-default-load-average nil)
      (display-time-mode 1))

    (use-package battery
      :config
      (setq battery-mode-line-format "[%b%p%%]")  ; Custom battery format to ensure the percentage sign is included
      (display-battery-mode 1))

    (defun simple-mode-line-render (left right)
      "Return a string of `window-width' length.
            Containing LEFT, and RIGHT aligned respectively."
      (let ((available-width
             (- (window-total-width)
                (+ (length (format-mode-line left))
                   (length (format-mode-line right))))))
        (append left
                (list (format (format "%%%ds" available-width) ""))
                right)))

    (use-package minions
      :config (minions-mode 1)
      :init
      (setq-default
       mode-line-format
       '((:eval
          (simple-mode-line-render
           ;; Left.
           (quote ("%e "
    			   mode-line-remote
    			   ":"
                   mode-line-buffer-identification
                   "%l:%c"
        		   " - %p"))
           ;; Right.
           (quote (""
                   mode-line-frame-identification
                   mode-line-modes
                   mode-line-misc-info)))))))

#+END_SRC

** Theme
#+BEGIN_SRC emacs-lisp
    (use-package doom-themes
      :config
      (setq doom-themes-enable-bold t
            doom-themes-enable-italic t)
      (load-theme 'doom-gruvbox t)
      (doom-themes-org-config))
#+END_SRC

** Font
#+BEGIN_SRC emacs-lisp
    (set-face-attribute 'default nil
                        :height 120
                        :weight 'medium)
    (setq-default line-spacing 0.15)
#+END_SRC

** Modeline
#+BEGIN_SRC emacs-lisp

#+END_SRC
** Zoom
#+BEGIN_SRC emacs-lisp
    (use-package emacs
      :bind
      ("C-+" . text-scale-increase)
      ("C--" . text-scale-decrease)
      ("<C-wheel-up>" . text-scale-increase)
      ("<C-wheel-down>" . text-scale-decrease))
#+END_SRC

** Which Key
#+BEGIN_SRC emacs-lisp
    (use-package which-key)
    (setq which-key-popup-type 'minibuffer)
    (which-key-mode)
#+END_SRC
* Completions
