emacs/.config/emacs/init.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(use-package no-littering
  :config
  (no-littering-theme-backups))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(use-package emacs
  :custom
  (menu-bar-mode nil)         
  (scroll-bar-mode nil)       
  (tool-bar-mode nil)         
  (inhibit-startup-screen t)  
  (delete-selection-mode t)   
  (electric-indent-mode nil)  
  (electric-pair-mode t)      
  (display-battery-mode t)
  (ring-bell-function 'ignore)
  (blink-cursor-mode nil)     
  (global-auto-revert-mode t) 
  (dired-kill-when-opening-new-dired-buffer t)
  (truncate-lines t)
  (gnus-agent nil)
  (display-line-numbers-type 'relative) 
  (global-display-line-numbers-mode t)
  (defalias 'yes-or-no-p 'y-or-n-p)
  (mouse-wheel-progressive-speed nil) 
  (scroll-conservatively 10)
  (scroll-margin 10)
  (tab-width 4)
  (make-backup-files nil)
  (auto-save-default nil)
  :config
  :bind (
		 ([escape] . keyboard-escape-quit) ;; Makes Escape quit prompts (Minibuffer Escape)
		 )
  :hook
  (prog-mode . (lambda () (hs-minor-mode t))))

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
;; Increase the amount of data which Emacs reads from the process
(setq read-process-output-max (* 1024 1024)) ;; 1mb

(custom-set-variables
 '(auto-save-visited-mode t))

(setq auto-save-visited-interval 2)

(use-package time
  :config
  (setq display-time-24hr-format t)
  (setq display-time-default-load-average nil)
  (display-time-mode 1))

(use-package battery
  :config
  (setq battery-mode-line-format "[%b%p%%]")  ; Custom battery format to ensure the percentage sign is included
  (display-battery-mode 1))

(defun simple-mode-line-render (left right)
  "Return a string of `window-width' length.
        Containing LEFT, and RIGHT aligned respectively."
  (let ((available-width
         (- (window-total-width)
            (+ (length (format-mode-line left))
               (length (format-mode-line right))))))
    (append left
            (list (format (format "%%%ds" available-width) ""))
            right)))

(use-package minions
  :config (minions-mode 1)
  :init
  (setq-default
   mode-line-format
   '((:eval
      (simple-mode-line-render
       ;; Left.
       (quote ("%e "
			   mode-line-remote
			   ":"
               mode-line-buffer-identification
               "%l:%c"
    		   " - %p"))
       ;; Right.
       (quote (""
               mode-line-frame-identification
               mode-line-modes
               mode-line-misc-info)))))))

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-gruvbox t)
  (doom-themes-org-config))

(set-face-attribute 'default nil
                    :height 120
                    :weight 'medium)
(setq-default line-spacing 0.15)



(use-package emacs
  :bind
  ("C-+" . text-scale-increase)
  ("C--" . text-scale-decrease)
  ("<C-wheel-up>" . text-scale-increase)
  ("<C-wheel-down>" . text-scale-decrease))

;;; Completions
