emacs/.config/emacs/config.org
*** Eglot
#+BEGIN_SRC emacs-lisp
    (use-package eglot
      :straight nil ;; Don't install eglot because it's now built-in
      :config
      (add-hook 'go-ts-mode-hook 'eglot-ensure)
      (add-hook 'ruby-ts-mode-hook 'eglot-ensure)
      (add-hook 'python-ts-mode-hook 'eglot-ensure)
      (add-hook 'rust-ts-mode-hook 'eglot-ensure)
      (add-hook 'php-mode-hook 'eglot-ensure)
      :custom
      (eglot-autoshutdown t)
      (fset #'jsonrpc--log-event #'ignore)
      (eglot-events-buffer-size 0) ;; No event buffers (Lsp server logs)
      (eglot-report-progress nil)
      (eglot-events-buffer-size 0)
      (eglot-sync-connect nil)
      (eglot-extend-to-xref nil)
      :bind (:map eglot-mode-map
        		  ("C-c l l" . eldoc-box-help-at-point)
        		  ("C-c l d" . eglot-find-declaration)
        		  ("C-c l i" . eglot-find-implementation)
        		  ("C-c l t" . eglot-find-typeDefinition)
        		  ("C-c l a" . eglot-code-actions)
        		  ("C-c l I" . eglot-code-action-organize-imports)
        		  ("C-c l f" . eglot-format-buffer)
        		  ("C-c l r" . eglot-rename)))

    (setq eglot-ignored-server-capabilities '(:documentHighlightProvider :inlayHintProvider))

    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(gdscript-mode . ("localhost:6005"))))

              ;;; Mason from neovim is just a great way to manage lsps
    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(bash-ts-mode . ("~/.local/share/nvim/mason/bin/bash-language-server"))))

    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(rust-ts-mode . ("~/.local/share/nvim/mason/bin/rust-analyzer"))))

    ;; (with-eval-after-load 'eglot
    ;;   (add-to-list 'eglot-server-programs
    ;;                '(php-ts-mode . ("~/.local/share/nvim/mason/bin/phpactor" "language-server"))))

    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(php-mode . ("~/.local/share/nvim/mason/bin/intelephense" "--stdio"))))

    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(go-ts-mode . ("~/.local/share/nvim/mason/bin/gopls"))))

    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(ruby-ts-mode . ("~/.local/share/nvim/mason/bin/ruby-lsp"))))

    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(python-ts-mode . ("~/.local/share/nvim/mason/bin/pyright-langserver" "--stdio"))))

#+END_SRC

*** Eglot Booster
I still need to install the rust binary and to make this work
#+BEGIN_SRC emacs-lisp 
    ;; (use-package eglot-booster
    ;;   :straight (eglot-booster :type git :host github :repo "jdtsmith/eglot-booster")
    ;; 	:after eglot
    ;; 	:config	(eglot-booster-mode))
#+END_SRC

** Terminal Emulation
#+begin_src emacs-lisp
    (use-package eat
      :hook ('eshell-load-hook #'eat-eshell-mode))
#+END_SRC

** Docker
#+begin_src emacs-lisp
    (use-package docker
      :straight t
      :bind ("C-c D" . docker))
#+end_src
* Project Managment
** Projectile 
Adds functions to work with projects
#+BEGIN_SRC emacs-lisp
    (use-package projectile
      :init
      (projectile-mode)
      :custom
      (projectile-run-use-comint-mode t) ;; Interactive run dialog when running projects inside emacs (like giving input)
      (projectile-switch-project-action #'projectile-dired) ;; Open dired when switching to a project
      (projectile-project-search-path '("~/projects/" "~/work/" ("~/code" . 2)))) ;; . 1 means only search the first subdirectory level for projects
    (setq persp-suppress-no-prefix-key-warning 't)
#+END_SRC

** Perspective 
My replacement for tmux
#+BEGIN_SRC emacs-lisp
    (use-package perspective
      :init
      (persp-mode))

    ;;; Each Project has its own perspective
    (use-package persp-projectile)
#+END_SRC

** Editor Conf
We want to use the same Configurations as out teamsmates
#+BEGIN_SRC emacs-lisp
    (use-package editorconfig
      :config
      (editorconfig-mode 1))
#+END_SRC

** Git Stuff
*** Magit
#+BEGIN_SRC emacs-lisp
    (use-package magit
      :commands magit-status)

    (use-package magit-todos
      :after magit
      :config (magit-todos-mode 1))
#+END_SRC

*** Gutter
#+begin_src emacs-lisp
    (use-package git-gutter
      :config(global-git-gutter-mode +1))
#+end_src

** File Managment
*** Wgrep
#+begin_src emacs-lisp
    (use-package wgrep)
#+END_SRC
*** Dired Tweaks
#+BEGIN_SRC emacs-lisp 
    (use-package dired
      :straight nil ;; built-in
      :hook
      (dired-mode . dired-hide-details-mode)
      :config
      (setq dired-dwim-target t)                  ;; do what I mean
      (setq dired-recursive-copies 'always)       ;; don't ask when copying directories
      (setq dired-create-destination-dirs 'ask)
      (setq dired-clean-confirm-killing-deleted-buffers nil)
      (setq dired-make-directory-clickable t)
      (setq dired-mouse-drag-files t)
      (setq dired-kill-when-opening-new-dired-buffer t)   ;; Tidy up open buffers by default
      (setq dired-use-ls-dired t
            dired-listing-switches "-aBhl  --group-directories-first"))

    (use-package nerd-icons-dired
      :after dired
      :hook
      (dired-mode . nerd-icons-dired-mode))
#+END_SRC

*** Harpoon
#+BEGIN_SRC  emacs-lisp
    (use-package harpoon)
#+END_SRC

* Helper packages
** Surround
#+BEGIN_SRC emacs-lisp 
    (use-package surround)
#+END_SRC

** Move Files
#+BEGIN_SRC emacs-lisp 
    (use-package move-text)

    (global-set-key (kbd "M-j") 'move-text-down)
    (global-set-key (kbd "M-k") 'move-text-up)
#+end_src

** Better undo and redo 
#+BEGIN_SRC emacs-lisp
    (use-package undo-tree
      :config (global-undo-tree-mode))
#+END_SRC

** Making emacs more explorable
#+BEGIN_SRC emacs-lisp
    (use-package helpful)
#+END_SRC

** Manage System packages from inside Emacs
#+BEGIN_SRC emacs-lisp
    (use-package system-packages)
#+END_SRC

** DevDocs
#+begin_src emacs-lisp
    (use-package devdocs)
#+end_src

** Usefull commands
Provides search and navigation commands based on the Emacs completion function.
Check out their [[https://github.com/minad/consult][git repository]] for more awesome functions.
#+begin_src emacs-lisp
    (use-package consult
      ;; Enable automatic preview at point in the *Completions* buffer. This is
      ;; relevant when you use the default completion UI.
      :hook (completion-list-mode . consult-preview-at-point-mode)
      :init
      ;; Optionally configure the register formatting. This improves the register
      ;; preview for `consult-register', `consult-register-load',
      ;; `consult-register-store' and the Emacs built-ins.
      (setq register-preview-delay 0.5
            register-preview-function #'consult-register-format)

      ;; Optionally tweak the register preview window.
      ;; This adds thin lines, sorting and hides the mode line of the window.
      (advice-add #'register-preview :override #'consult-register-window)

      ;; Use Consult to select xref locations with preview
      (setq xref-show-xrefs-function #'consult-xref
            xref-show-definitions-function #'consult-xref)
      :config
      (autoload 'projectile-project-root "projectile")
      (setq consult-project-function (lambda (_) (projectile-project-root)))
      )
#+end_src

** Collection of usefull commands
#+BEGIN_SRC emacs-lisp
    (use-package crux)
#+END_SRC

* File spezific Modes
** Rust
#+BEGIN_SRC emacs-lisp 
    (use-package rust-mode
      :init
      (setq rust-mode-treesitter-derive t))

    (setq rustic-lsp-client 'eglot)
    (setq rustic-analyzer-command '("~/.local/share/nvim/mason/bin/rust-analyzer"))

    (use-package rustic
      :after (rust-mode))
#+END_SRC
** Python
#+begin_src emacs-lisp
    (use-package pet
      :config
      (add-hook 'python-base-mode-hook 'pet-mode -10))

    (use-package pyvenv)
#+END_SRC
** Markdown
*** Obsidian
#+begin_src emacs-lisp
    (use-package obsidian
      :demand t
      :config
      (obsidian-specify-path "~/code/Cadmus/")
      (global-obsidian-mode t)
      :custom
      (obsidian-inbox-directory "Inbox")
      (obsidian-daily-notes-directory "Daily Notes")
      :bind (:map obsidian-mode-map
    			  ("C-c C-o" . obsidian-follow-link-at-point)
    			  ("C-c C-b" . obsidian-backlink-jump)
    			  ("C-c C-l" . obsidian-insert-wikilink)))
#+END_SRC
*** Markdown Mode
#+begin_src emacs-lisp
    (use-package markdown-mode
      :mode ("README\\.md\\'" . gfm-mode)
      :init (setq markdown-command "multimarkdown"))
#+END_SRC
** Org 
*** Org Mode

#+begin_src emacs-lisp
    (use-package org
      :custom
      (org-edit-src-content-indentation 4) ;; Set src block automatic indent to 4 instead of 2.
      (org-startup-indented t)
      (org-startup-with-inline-images t)
      (org-image-actual-width '(450))
      (org-fold-catch-invisible-edits 'error)
      (org-pretty-entities t)
      (org-id-link-to-org-use-id t)
      (org-fold-catch-invisible-edits 'show)

      :hook
      (org-mode . org-indent-mode))

    (custom-set-faces
     '(org-level-1 ((t (:inherit outline-1 :height 1.5))))
     '(org-level-2 ((t (:inherit outline-2 :height 1.4))))
     '(org-level-3 ((t (:inherit outline-3 :height 1.3))))
     '(org-level-4 ((t (:inherit outline-4 :height 1.2))))
     '(org-level-5 ((t (:inherit outline-5 :height 1.1))))
     '(org-level-6 ((t (:inherit outline-5 :height 1.0))))
     '(org-level-7 ((t (:inherit outline-5 :height 1.0)))))

    (add-hook 'org-mode-hook 'visual-line-mode)

    (setq org-startup-folded 'fold)
#+end_src
*** Table of Contents
#+begin_src emacs-lisp
    (use-package toc-org
      :after org
      :commands toc-org-enable
      :hook (org-mode . toc-org-mode))
#+end_src
*** Org Modern
#+BEGIN_SRC emacs-lisp
    (use-package org-modern
      :after  org
      :hook (org-mode . org-modern-mode))
#+END_SRC

* Keymaps
** Meow
