emacs/.config/emacs/init.el
  :straight nil ;; Don't install eglot because it's now built-in
  :config
  (add-hook 'go-ts-mode-hook 'eglot-ensure)
  (add-hook 'ruby-ts-mode-hook 'eglot-ensure)
  (add-hook 'python-ts-mode-hook 'eglot-ensure)
  (add-hook 'rust-ts-mode-hook 'eglot-ensure)
  :custom
  (eglot-autoshutdown t)
  (fset #'jsonrpc--log-event #'ignore)
  (eglot-events-buffer-size 0) ;; No event buffers (Lsp server logs)
  (eglot-report-progress nil)
  (eglot-events-buffer-size 0)
  (eglot-sync-connect nil)
  (eglot-extend-to-xref nil)
  :bind (:map eglot-mode-map
    		  ("C-c l l" . eldoc-box-help-at-point)
    		  ("C-c l d" . eglot-find-declaration)
    		  ("C-c l i" . eglot-find-implementation)
    		  ("C-c l t" . eglot-find-typeDefinition)
    		  ("C-c l a" . eglot-code-actions)
    		  ("C-c l I" . eglot-code-action-organize-imports)
    		  ("C-c l f" . eglot-format-buffer)
    		  ("C-c l r" . eglot-rename)))

(setq eglot-ignored-server-capabilities '(:documentHighlightProvider :inlayHintProvider))

(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(gdscript-mode . ("localhost:6005"))))

          ;;; Mason from neovim is just a great way to manage lsps
(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(bash-ts-mode . ("~/.local/share/nvim/mason/bin/bash-language-server"))))

(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(rust-ts-mode . ("~/.local/share/nvim/mason/bin/rust-analyzer"))))

(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(go-ts-mode . ("~/.local/share/nvim/mason/bin/gopls"))))

(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(ruby-ts-mode . ("~/.local/share/nvim/mason/bin/ruby-lsp"))))

(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(python-ts-mode . ("~/.local/share/nvim/mason/bin/pyright-langserver" "--stdio"))))

(use-package eat
  :hook ('eshell-load-hook #'eat-eshell-mode))

(use-package docker
  :straight t
  :bind ("C-c d" . docker))

(use-package projectile
  :init
  (projectile-mode)
  :custom
  (projectile-run-use-comint-mode t) ;; Interactive run dialog when running projects inside emacs (like giving input)
  (projectile-switch-project-action #'projectile-dired) ;; Open dired when switching to a project
  (projectile-project-search-path '("~/projects/" "~/work/" ("~/code" . 2)))) ;; . 1 means only search the first subdirectory level for projects
(setq persp-suppress-no-prefix-key-warning 't)

(use-package perspective
  :init
  (persp-mode))

;;; Each Project has its own perspective
(use-package persp-projectile)

(use-package editorconfig
  :config
  (editorconfig-mode 1))

(use-package harpoon)

(use-package magit
  :commands magit-status)

(use-package magit-todos
  :after magit
  :config (magit-todos-mode 1))

(use-package git-gutter
  :config(global-git-gutter-mode +1))

(use-package undo-tree
  :config (global-undo-tree-mode))

(use-package helpful)

(use-package system-packages)

(use-package devdocs)

(use-package consult
  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  :config
  (autoload 'projectile-project-root "projectile")
  (setq consult-project-function (lambda (_) (projectile-project-root)))
  )

(use-package crux)

(use-package meow)
