emacs/.config/emacs/init.el

(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-overwrite-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))
  (meow-leader-define-key
   ;; SPC j/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet))

  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("6" . meow-expand-6)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)

   '("-" . negative-argument)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("a" . meow-append)
   '("A" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("f" . meow-find)
   '("g" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-left)
   '("H" . meow-left-expand)
   '("i" . meow-insert)
   '("I" . meow-open-above)
   '("j" . meow-next)
   '("J" . meow-next-expand)
   '("k" . meow-prev)
   '("K" . meow-prev-expand)
   '("l" . meow-right)
   '("L" . meow-right-expand)
   '("m" . meow-join)
   '("n" . meow-search)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-yank)
   '("q" . meow-quit)
   '("Q" . meow-goto-line)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   '("s" . meow-kill)
   '("t" . meow-till)
   
   '("u" . undo-tree-undo)
   '("U" . undo-tree-redo)

   '("v" . meow-visit)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-sync-grab)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("<escape>" . ignore)))

(meow-setup)
(setq meow-keypad-leader-dispatch "C-c")
(meow-global-mode 1)

(use-package meow-tree-sitter
  :after (meow treesitter))
(meow-tree-sitter-register-defaults)

(defun marker-is-point-p (marker)
  "test if marker is current point"
  (and (eq (marker-buffer marker) (current-buffer))
       (= (marker-position marker) (point))))

(defun push-mark-maybe () 
  "push mark onto `global-mark-ring' if mark head or tail is not current location"
  (if (not global-mark-ring) (error "global-mark-ring empty")
    (unless (or (marker-is-point-p (car global-mark-ring))
                (marker-is-point-p (car (reverse global-mark-ring))))
      (push-mark))))


(defun backward-global-mark () 
  "use `pop-global-mark', pushing current point if not on ring."
  (interactive)
  (push-mark-maybe)
  (when (marker-is-point-p (car global-mark-ring))
    (call-interactively 'pop-global-mark))
  (call-interactively 'pop-global-mark))

(defun forward-global-mark ()
  "hack `pop-global-mark' to go in reverse, pushing current point if not on ring."
  (interactive)
  (push-mark-maybe)
  (setq global-mark-ring (nreverse global-mark-ring))
  (when (marker-is-point-p (car global-mark-ring))
    (call-interactively 'pop-global-mark))
  (call-interactively 'pop-global-mark)
  (setq global-mark-ring (nreverse global-mark-ring)))

(global-set-key (kbd "M-h") 'backward-global-mark)
(global-set-key (kbd "M-l") 'forward-global-mark)

(defun my/find-buffer ()
  "Use `consult-project-buffer` if in a project, otherwise `consult-buffer`."
  (interactive)
  (if (projectile-project-p)
      (consult-project-buffer)
    (consult-buffer)))

(global-set-key (kbd "C-c b C") 'clean-buffer-list)
(global-set-key (kbd "C-c b k") 'kill-current-buffer)
(global-set-key (kbd "C-c b K") 'kill-some-buffers)
(global-set-key (kbd "C-c b O") 'crux-kill-other-buffers)
(global-set-key (kbd "C-c b r") 'revert-buffer)
(global-set-key (kbd "C-c b b") 'my/find-buffer)
(global-set-key (kbd "C-c b i") 'ibuffer)

(global-set-key (kbd "C-c w h") 'windmove-left)
(global-set-key (kbd "C-c w l") 'windmove-right)
(global-set-key (kbd "C-c w k") 'windmove-up)
(global-set-key (kbd "C-c w j") 'windmove-down)

(global-set-key (kbd "C-c w v") 'split-window-right)
(global-set-key (kbd "C-c w s") 'split-window-below)

(global-set-key (kbd "C-c w d") 'delete-window)
(global-set-key (kbd "C-c w o") 'delete-other-windows)

(global-set-key (kbd "C-c G G") 'magit-status)
(global-set-key (kbd "C-c G s") 'git-gutter:stage-hunk)
(global-set-key (kbd "C-c G i") 'git-gutter:previous-hunk)
(global-set-key (kbd "C-c G k") 'git-gutter:next-hunk)

(global-set-key (kbd "C-c t p") 'eat-project)
(global-set-key (kbd "C-c t P") 'eat-project-other-window)
(global-set-key (kbd "C-c t t") 'eat)
(global-set-key (kbd "C-c t T") 'eat-other-window)

(global-set-key (kbd "C-c e i") 'flycheck-previous-error)
(global-set-key (kbd "C-c e k") 'flycheck-next-error)
(global-set-key (kbd "C-c e l") 'flycheck-list-errors)
(global-set-key (kbd "C-c e L") 'flycheck-projectile-list-errors)
(global-set-key (kbd "C-c e e") 'flycheck-explain-error-at-point)
(global-set-key (kbd "C-c e d") 'flycheck-display-error-at-point)

(defun compile-or-open ()
  "Open the existing compilation buffer in a split window, or run compile if it doesn't exist."
  (interactive)
  (let ((compilation-buffer (get-buffer "*compilation*")))
    (if compilation-buffer
        (progn
          (unless (get-buffer-window compilation-buffer)
            (save-selected-window
              (select-window (split-window-below -15))
              (switch-to-buffer compilation-buffer)
              (shrink-window-if-larger-than-buffer))))
      (call-interactively 'compile))))

(global-set-key (kbd "C-c C o") 'compile-or-open)
(global-set-key (kbd "C-c C c") 'projectile-compile-project)
(global-set-key (kbd "C-c C r") 'recompile)
(global-set-key (kbd "C-c C k") 'kill-compilation)

(global-set-key (kbd "C-c C e i") 'compilation-next-error)
(global-set-key (kbd "C-c C e k") 'compilation-previous-error)
(global-set-key (kbd "C-c C e l") 'consult-compile-error)

(defun my/find-file ()
  "Use `projectile-find-file` if in a project, otherwise `find-file`."
  (interactive)
  (if (projectile-project-p)
      (projectile-find-file)
    (find-file)))


(global-set-key (kbd "C-c f f") 'my/find-file)
(global-set-key (kbd "C-c f F") 'find-file)
(global-set-key (kbd "C-c f g") 'consult-ripgrep)
(global-set-key (kbd "C-c f o") 'consult-outline)
