emacs/.config/emacs/init.el

(global-set-key (kbd "C-c 1") 'harpoon-go-to-1)
(global-set-key (kbd "C-c 2") 'harpoon-go-to-2)
(global-set-key (kbd "C-c 3") 'harpoon-go-to-3)
(global-set-key (kbd "C-c 4") 'harpoon-go-to-4)
(global-set-key (kbd "C-c 5") 'harpoon-go-to-5)

(global-set-key (kbd "C-c H a") 'harpoon-add-file)
(global-set-key (kbd "C-c H l") 'harpoon-toggle-quick-menu)
(global-set-key (kbd "C-c H f") 'harpoon-toggle-file)
(global-set-key (kbd "C-c H H") 'harpoon-quick-menu-hydra)

(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
(define-key projectile-mode-map (kbd "C-c P") 'perspective-map)
